In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 
from os import listdir

In [5]:
import sys  
sys.path.insert(0, '../PreProcessing/')

from utils import *
from parse_df import *
from split_name import *
from char_utils import *

In [1]:
%ls

Data_PreProcessing.ipynb  ERDataStats.ipynb

In [ ]:
getStateData(files, loc)

In [2]:
# Correct and update MEghalaya csv

In [11]:
def getStateData(files, loc):
    req = []
    for file in files:
        if ".csv" in file:
            req.append(file)
    df = pd.concat([pd.read_csv(loc+file, header=0, names=['name','father_name','husband_name','mother_name','house_number','gender','age']) for file in req], ignore_index=True)
    return df

In [7]:
files = listdir(MEGHALAYA)

In [8]:
df = getStateData(listdir(MEGHALAYA), MEGHALAYA)

In [13]:
daman = getStateData(listdir(DAMAN), DAMAN)
daman.to_csv(DAMAN_CSV)

In [14]:
manipur = getStateData(listdir(MANIPUR), MANIPUR)
manipur.to_csv(MANIPUR_CSV)

In [15]:
meghalaya = getStateData(listdir(MEGHALAYA), MEGHALAYA)
meghalaya.to_csv(MEGHALAYA_CSV)

In [17]:
nagaland = getStateData(listdir(NAGALAND), NAGALAND)
nagaland.to_csv(NAGALAND_CSV)

In [19]:
arunachal =getStateData(listdir(ARUNACHAL), ARUNACHAL)
arunachal.to_csv(ARUNACHAL_CSV)

In [16]:
delhi = getStateData(listdir(DELHI), DELHI)
delhi.to_csv(DELHI_CSV)

In [20]:
sikkim = getStateData(listdir(SIKKIM), SIKKIM)
sikkim.to_csv(SIKKIM_CSV)

In [21]:
mizoram = getStateData(listdir(MIZORAM), MIZORAM)
mizoram.to_csv(MIZORAM_CSV)

In [22]:
meg = pd.read_csv(MEGHALAYA_CSV)

In [23]:
meg.head()

,Unnamed: 0,name,father_name,husband_name,mother_name,house_number,gender,age
0,0,AILAD SUCHIANG,SDIH TYNGKAN,NaN,NaN,1,FEMALE,70
1,1,RIIEl HOK SUCHIANG,NaN,NaN,AILAD SUCHIANG,1,FEMALE,29
2,2,RIDALIN SUCHIANG,SHIA BIAM,NaN,NaN,1,FEMALE,42
3,3,MARDEIMON SUCHIANG,ERAS WORLOI,NaN,NaN,1,FEMALE,25
4,4,DOLBI SUCHIANG,NaN,BNAl SHADAP,NaN,2,FEMALE,52

In [24]:
meg['name'] = [ name.replace('Other\'s : ', ' ') for name in meg['name']]

In [32]:
meg.to_csv(MEGHALAYA_CSV)

In [33]:
meg.head()

,name,father_name,husband_name,mother_name,house_number,gender,age
0,AILAD SUCHIANG,SDIH TYNGKAN,NaN,NaN,1,FEMALE,70
1,RIIEl HOK SUCHIANG,NaN,NaN,AILAD SUCHIANG,1,FEMALE,29
2,RIDALIN SUCHIANG,SHIA BIAM,NaN,NaN,1,FEMALE,42
3,MARDEIMON SUCHIANG,ERAS WORLOI,NaN,NaN,1,FEMALE,25
4,DOLBI SUCHIANG,NaN,BNAl SHADAP,NaN,2,FEMALE,52